app/Livewire/CommandeForm.php

select * from `product_categories`
---
    public function mount()
    {
        $this->categories = ProductCategories::all();

select * from `products` where `product_categories_id` = 1
---
    public function selectCategories($categoryId)
    {
        $this->selectedCategory = $categoryId;
        $this->products = Product::where('product_categories_id', $categoryId)->get();

select * from `products` where `products`.`id` = 18 limit 1
---
    public function addProductToOrder($productId)
    {
        $product = Product::find($productId);

insert into `orders` (`type`, `name`, `phone_number`, `delivery_time`, `table_number`, `person_number`, `comment`, `total_price`, `state`, `paid`, `updated_at`, `created_at`) values ('emporter', 'Tony', '0612345678', '2025-06-19 18:00:00', '', '', '', 628434304.19875, 'en_attente', 0, '2025-06-19 15:17:23', '2025-06-19 15:17:23')
insert into `order_lines` (`order_id`, `product_id`, `quantity`, `price`, `updated_at`, `created_at`) values (22, 1, 1, 628123126.01134, '2025-06-19 15:17:23', '2025-06-19 15:17:23')
---
    public function validerCommande()
    {

        if (empty($this->orderLines) || !$this->type) {
            session()->flash('error', 'Veuillez compléter la commande.');
            return;
        }

        // Calcul du total général de la commande
        $total = collect($this->orderLines)->sum(function ($line) {
            return $line['quantity'] * $line['unit_price'];
        });

        // Création de la commande avec les nouveaux champs
        $order = Order::create([
            'type' => $this->type,
            'name' => $this->form['name'] ?? null,
            'phone_number' => $this->form['phoneNumber'] ?? null,
            'delivery_time' => $this->form['deliveryTime'] === "" ? now() : $this->form['deliveryTime'],
            'table_number' => $this->form['tableNumber'] ?? null,
            'person_number' => $this->form['personNumber'] ?? null,
            'comment' => $this->form['comment'],
            'total_price' => $total,
            'state' => 'en_attente', // ou 'draft', etc.
            'paid' => false,
        ]);

        // Création des lignes de commande sans total_price
        foreach ($this->orderLines as $line) {
            OrderLine::create([
                'order_id' => $order->id,
                'product_id' => $line['product_id'],
                'quantity' => $line['quantity'],
                'price' => $line['unit_price'] * $line['quantity'],
            ]);