app/Livewire/CommandeFormUpdate.php

    public function mount($id)
    {
        $this->order = Order::find($id);
        $this->type = $this->order->type;

        // Utilise $this->order pour accéder aux propriétés
        $this->form['name'] = $this->order->name;
        $this->form['phoneNumber'] = $this->order->phone_number;
        $this->form['deliveryTime'] = $this->order->delivery_time;
        $this->form['personNumber'] = $this->order->person_number;
        $this->form['tableNumber'] = $this->order->table_number;
        $this->form['comment'] = $this->order->comment;

        $this->categories = ProductCategories::all();
        $this->orderLines = OrderLine::where('order_id', $id)
            ->with('product')
            ->get()
            ->map(function ($line) {
                return [
                    'product_id' => $line->product_id,
                    'product_name' => $line->product->name ?? '',
                    'quantity' => $line->quantity,
                    'unit_price' => $line->product->price,
                    'total_price' => $line->quantity * $line->product->price,
                ];
            })->toArray();
---
select * from `orders` where `orders`.`id` = 36 limit 1
select * from `product_categories`
select * from `order_lines` where `order_id` = 36
select * from `products` where `products`.`id` in (1, 10)