app/Livewire/KitchenOrderView.php

    public function toggleOrderLine($orderLineId)
    {
        $orderLine = OrderLine::find($orderLineId);
---
select * from `order_lines` where `order_lines`.`id` = 50 limit 1

    public function render()
    {
        return view('livewire.kitchen-order-view',
        ['categories' => ProductCategories::all()]);
---
select * from `product_categories`