app/Livewire/KitchenOrderView.php

    public function render()
    {
        $categories = ProductCategories::all();


        $now = Carbon::now();
        $fourHoursAgo = $now->copy()->subHours(4);
        $today = Carbon::today();

        $orders = Order::select('*')
            ->selectRaw("
            CASE
                WHEN type = 'emporter' THEN DATE_SUB(delivery_time, INTERVAL 15 MINUTE)
                ELSE created_at
            END AS sort_time
        ")
            ->whereRaw("
            DATE(
                CASE
                    WHEN type = 'emporter' THEN DATE_SUB(delivery_time, INTERVAL 15 MINUTE)
                    ELSE created_at
                END
            ) = ?
        ", [$today->toDateString()])
            ->whereRaw("
            (
                CASE
                    WHEN type = 'emporter' THEN DATE_SUB(delivery_time, INTERVAL 15 MINUTE)
                    ELSE created_at
                END
            ) >= ?
        ", [$fourHoursAgo->toDateTimeString()])
            ->orderBy('sort_time', 'asc')
            ->get();
---
select * from `product_categories`
select *,
CASE
WHEN type = 'emporter' THEN DATE_SUB(delivery_time, INTERVAL 15 MINUTE)
ELSE created_at
END AS sort_time
from `orders` where
DATE(
CASE
WHEN type = 'emporter' THEN DATE_SUB(delivery_time, INTERVAL 15 MINUTE)
ELSE created_at
END
) = '2025-06-19'
and
(
CASE
WHEN type = 'emporter' THEN DATE_SUB(delivery_time, INTERVAL 15 MINUTE)
ELSE created_at
END
) >= '2025-06-19 06:33:36'
order by `sort_time` asc