app/Livewire/OrderView.php

    public function toggleOrderLine($orderLineId)
    {
        $orderLine = OrderLine::find($orderLineId);
---
select * from `order_lines` where `order_lines`.`id` = 2 limit 1

    public function togglePayment()
    {
            $this->order->paid = !$this->order->paid;
            $this->order->save();
---
update `orders` set `paid` = 0, `orders`.`updated_at` = '2025-06-19 15:14:13' where `id` = 21