app/Http/Controllers/DashboardController.php

    public function view( ?Request $request, ?string $state = null)
    {
        $date = null;

        if ($request !== null) {
            $date = $request->input('date');
        }

        $orderStateExpected = $state ?? session()->get('orderStateExpected', 'en_attente');
        session()->put('orderStateExpected', $orderStateExpected);

        $orders = Order::where('state', $orderStateExpected);

        if ($date !== null) {
            $date = Carbon::parse($date);
            $orders->whereDate('delivery_time', $date->format('Y-m-d') );
        } elseif
        (Carbon::now()->format('H:i') < '17:00') {
            $orders->whereBetween('delivery_time', [Carbon::now()->format('Y-m-d 08:00:00'), Carbon::now()->format('Y-m-d 17:00:00')]);
        } else {
            $orders->whereBetween('delivery_time', [Carbon::now()->format('Y-m-d 17:00:00'), Carbon::tomorrow()->format('Y-m-d 08:00:00')]);
        }


        $data = [
            'title' => 'Commandes',
            'orders' => $orders->get()
        ];
---
select * from `orders` where `state` = 'en_attente' and `delivery_time` between '2025-06-19 08:00:00' and '2025-06-19 17:00:00'

    function kitchen_view(?string $state = null)
    {
        $orderStateExpected = $state ?? session()->get('orderStateExpected', 'en_attente');
        session()->put('orderStateExpected', $orderStateExpected);

        $orders = Order::where('state', $orderStateExpected);

        if ($date) {
            $orders->where('delivery_time', $date->format('Y-m-d'));
        } elseif (Carbon::now()->format('H:i') < '17:00') {
            $orders->whereBetween('delivery_time', [Carbon::now()->format('Y-m-d 08:00:00'), Carbon::now()->format('Y-m-d 17:00:00')]);
        } else {
            $orders->whereBetween('delivery_time', [Carbon::now()->format('Y-m-d 17:00:00'), Carbon::tomorrow()->format('Y-m-d 08:00:00')]);
        }

        $categories = ProductCategories::all();

        $data = [
            'page' => 'dashboard/kitchen-order-view',
            'title' => 'Commandes cuisine',
            'orders' => $orders->get(),
        ];
---
select * from `product_categories`
select * from `orders` where `state` = 'en_attente' and `delivery_time` between '2025-06-19 08:00:00' and '2025-06-19 17:00:00'