app/Models/OrderLine.php

    public function toggle() :void
    {
        $this->update(['status'=> !$this->status ]);
---
update `order_lines` set `status` = 0, `order_lines`.`updated_at` = '2025-06-19 10:40:47' where `id` = 50